Repository: 3m5/typo3-enhanced-backend
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# user_settings.active
source: Enable enhanced backend visuals
de: Aktiviere verbesserte optische Verbesserungen

# user_settings.darkmode
source: Enable dark mode
de: Aktiviere dark mode

# presets.none.label
source: No changes
de: Keine Änderungen

# presets.none.description
source: Original TYPO3 backend
de: Originales TYPO3 Backend

# presets.vanilla.description
source: The preset Vanilla⁺ is based on the corporate design of TYPO3. Functionalities are not changed or added. There are only minor UI optimizations.
de: Das Preset Vanilla⁺ basiert auf dem Corporate Design von TYPO3. Funktionalitäten werden nicht verändert oder hinzugefügt. Es gibt nur kleinere UI-Optimierungen.

# presets.modern.description
source: The 'Modern' preset activates all available features and optimizations of the Enhanced Backend extension. The UI/UX is based on current developments and there is a content tree that allows quick navigation over all content on a page.
de: Die Voreinstellung "Modern" aktiviert alle verfügbaren Funktionen und Optimierungen der Erweiterung "Enhanced Backend". Die UI/UX basiert auf aktuellen Entwicklungen und es gibt einen Inhaltsbaum, der eine schnelle Navigation über alle Inhalte auf einer Seite ermöglicht.

# presets.custom.label
source: Custom
de: Benutzerdefiniert

# presets.custom.description
source: This preset takes over the last selected settings (from the other presets) and allows individual dis-/enabling of individual features and optimizations.
de: Dieses Preset übernimmt die zuletzt gewählten Einstellungen (aus den anderen Presets) und ermöglicht das individuelle De-/Aktivieren einzelner Funktionen und Optimierungen.

# groups.global.description
source: These settings affect all areas of the TYPO3 backend.
de: Diese Einstellungen wirken sich auf alle Bereiche des TYPO3 - Backends aus.

# groups.topbar.title
source: Header area
de: Header-Bereich

# groups.topbar.description
source: These settings affect the top bar, where your login is located, for example.
de: Diese Einstellungen wirken sich auf die obere Leiste aus, in der sich beispielsweise dein Login befindet.

# groups.sidebar.title
source: Sidebar
de: Seitenleiste

# groups.sidebar.description
source: These settings affect the sidebar on the left side of the screen where the different modules are located.
de: Diese Einstellungen wirken sich auf die Seitenleiste am linken Bildschirmrand aus, in der sich die verschiedenen Module befinden.

# groups.pageTree.title
source: Page tree
de: Seitenbaum

# groups.pageTree.description
source: These settings affect the page tree, located to the right of the sidebar.
de: Diese Einstellungen wirken sich auf den Seitenbaum, der sich rechts neben der Seitenleiste befindet, aus.

# groups.contentArea.title
source: Content area
de: Inhaltsbereich

# groups.contentArea.description
source: The content area is the area where the contents of the respective modules are shown from the sidebar.
de: Der Inhaltsbereich ist der Bereich, in dem die Inhalte der jeweiligen Module gezeigt werden aus der Seitenleiste angezeigt werden.

# groups.contentElementWizard.title
source: Content element wizard
de: Inhaltselementwizard

# groups.contentElementWizard.description
source: This dialog becomes visible when creating a new content element.
de: Dieser Dialog wird beim Erstellen eines neuen Inhaltselements sichtbar.

# global.enhancedIcons.title
source: Enhanced Icons
de: Optimierte Icons

# global.enhancedIcons.description
source: Replace the default TYPO3 icons with a modern and user-friendly icon set. <em>⇾ Requires a page reload to make the change visible.</em>
de: Tausche die Standard-Icons von TYPO3 mit einem modernen und benutzerfreundlichen Iconset aus. <em>⇾ Erfordert einen Page Reload, damit die Änderung sichtbar wird.</em>

# global.enhancedFont.title
source: Enhanced Font
de: Optimierte Schriftart

# global.enhancedFont.description
source: Use the optimized "Inter" font for better display of elements and texts.
de: Verwende die optimierte Schriftart "Inter" für eine bessere Darstellung von Elementen und Texten.

# topbar.enhancedWidgetOrder.title
source: Reorder icons on the right
de: Icons rechts umsortieren

# topbar.enhancedWidgetOrder.description
source: The username is moved to the upper right corner, as users are used to from other applications.
de: Der Nutzername wird in die rechte obere Ecke gerückt, so wie es Nutzer aus anderen Anwendungen gewohnt sind.

# sidebar.collapseButtonPosition.title
source: Move sidebar collapse toggle to bottom edge
de: Seitenlisten-Einklapp-Button an unteren Rand verschieben

# sidebar.collapseButtonPosition.description
source: Positions the sidebar collapse toggle from the upper left corner to the end of the sidebar.
de: Positioniert den Button zum Einklappen der Seitenleiste von der linken oberen Ecke an das Ende der Seitenleiste.

# sidebar.enhancedMenuUI.title
source: Enhanced Menu UI
de: Optimiertes Menü UI

# sidebar.enhancedMenuUI.description
source: Improves the color design of module entries, spacing and visual separation of groups.
de: Verbessert die farbliche Gestaltung der Modul-Einträge, Abstände und visuelle Trennung von Gruppen.

# pageTree.enhancedToolbarUI.title
source: Enhance toolbar over page tree
de: Toolbar über Seitenbaum optimieren

# pageTree.enhancedToolbarUI.description
source: Buttons get more spacing to be more clickable. The search field is displayed in a more modern way.
de: Buttons erhalten mehr Abstände, um besser klickbar zu sein. Das Suchfeld wird moderner dargestellt.

# pageTree.enabledContentTree.title
source: Enable content tree
de: Inhaltsbaum aktivieren

# pageTree.enabledContentTree.description
source: Inserts a tree below the page tree that maps the content elements of the currently selected page.
de: Fügt unterhalb des Seitenbaums einen Baum ein, der die Inhaltselemente der aktuell ausgewählten Seite abbildet.

# contentArea.enhancedOverviewUI.title
source: Enhanced content area
de: Optimierter Inhaltsbereich

# contentArea.enhancedOverviewUI.description
source: Content element frames are moved to the background to focus on the content. Buttons and titles are repositioned for a better overview.
de: Inhaltselement-Rahmen werden in den Hintergrund gerückt, um den Fokus auf die Inhalte zu setzen. Buttons und Titel werden repositioniert für einen besseren Überblick.

# contentArea.enhancedToolbar.title
source: Enhanced Toolbar
de: Optimierte Toolbar

# contentArea.enhancedToolbar.description
source: Spacing is consistent with the page tree toolbar. Larger click areas make the work easier.
de: Abstände sind im Einklang mit der Toolbar des Seitenbaums. Größere Klickflächen erleichtern die Arbeit.

# contentArea.enhancedEditingForm.title
source: Enhanced "Edit" Form
de: Optimiertes Formular "Bearbeiten"

# contentArea.enhancedEditingForm.description
source: Form elements are aligned using a grid. Frames are visually placed in the background so editors can focus on content.
de: Formularelemente werden anhand eines Rasters ausgerichtet. Rahmen werden optisch in den Hintergrund gestellt, damit Redakteure sich auf die Inhalte fokussieren können.
